[
  {
    "id": "bitcoin",
    "symbol": "btc",
    "name": "Bitcoin",
    "image": "https://assets.coingecko.com/coins/images/1/large/bitcoin.png?1547033579",
    "current_price": 16962.21,
    "market_cap": 324718794812,
    "market_cap_rank": 1,
    "fully_diluted_valuation": 355947584982,
    "total_volume": 42279110530,
    "high_24h": 17388.04,
    "low_24h": 16201.1,
    "price_change_24h": 224.1,
    "price_change_percentage_24h": 1.33884,
    "market_cap_change_24h": 3550524318,
    "market_cap_change_percentage_24h": 1.1055,
    "circulating_supply": 19157581.0,
    "total_supply": 21000000.0,
    "max_supply": 21000000.0,
    "ath": 51032,
    "ath_change_percentage": -66.80484,
    "ath_date": "2021-11-10T14:24:11.849Z",
    "atl": 43.9,
    "atl_change_percentage": 38486.13952,
    "atl_date": "2013-07-05T00:00:00.000Z",
    "roi": null,
    "last_updated": "2022-09-22T10:34:23.184Z",
    "coin_description": "Bitcoin is the first successful internet money based on peer-to-peer technology; whereby no central bank or authority is involved in the transaction and production of the Bitcoin currency. It was created by an anonymous individual/group under the name, Satoshi Nakamoto. The source code is available publicly as an open source project, anybody can look at it and be part of the developmental process. Bitcoin is changing the way we see money as we speak. The idea was to produce a means of exchange, independent of any central authority, that could be transferred electronically in a secure, verifiable and immutable way. It is a decentralized peer-to-peer internet currency making mobile payment easy, very low transaction fees, protects your identity, and it works anywhere all the time with no central authority and banks. Bitcoin is designed to have only 21 million BTC ever created, thus making it a deflationary currency. Bitcoin uses the SHA-256 hashing algorithm with an average transaction confirmation time of 10 minutes. Miners today are mining Bitcoin using ASIC chip dedicated to only mining Bitcoin, and the hash rate has shot up to peta hashes. Being the first successful online cryptography currency, Bitcoin has inspired other alternative currencies such as Litecoin, Peercoin, Primecoin, and so on. The cryptocurrency then took off with the innovation of the turing-complete smart contract by Ethereum which led to the development of other amazing projects such as EOS, Tron, and even crypto-collectibles such as CryptoKitties."
  },

  {
    "id": "ethereum",
    "symbol": "eth",
    "name": "Ethereum",
    "image": "https://assets.coingecko.com/coins/images/279/large/ethereum.png?1595348880",
    "current_price": 1146.41,
    "market_cap": 137681214772,
    "market_cap_rank": 2,
    "fully_diluted_valuation": 205079023238,
    "total_volume": 18800844298,
    "high_24h": 1219.67,
    "low_24h": 1093.32,
    "price_change_24h": -33.493591750023825,
    "price_change_percentage_24h": -2.83867,
    "market_cap_change_24h": -4725073053.609131,
    "market_cap_change_percentage_24h": -3.31802,
    "circulating_supply": 120626085.662685,
    "total_supply": 120626085.662685,
    "max_supply": null,
    "ath": 3610.11,
    "ath_change_percentage": -68.38411,
    "ath_date": "2021-11-12T02:17:36.494Z",
    "atl": 0.280314,
    "atl_change_percentage": 407074.55976,
    "atl_date": "2015-10-20T00:00:00.000Z",
    "roi": {
      "times": 89.425166615897,
      "currency": "btc",
      "percentage": 8942.5166615897
    },
    "last_updated": "2022-09-22T10:34:58.010Z",
    "coin_description": "Ethereum is a global, open-source platform for decentralized applications. In other words, the vision is to create a world computer that anyone can build applications in a decentralized manner; while all states and data are distributed and publicly accessible. Ethereum supports smart contracts in which developers can write code in order to program digital value. Examples of decentralized apps (dapps) that are built on Ethereum includes tokens, non-fungible tokens, decentralized finance apps, lending protocol, decentralized exchanges, and much more. On Ethereum, all transactions and smart contract executions require a small fee to be paid. This fee is called Gas. In technical terms, Gas refers to the unit of measure on the amount of computational effort required to execute an operation or a smart contract. The more complex the execution operation is, the more gas is required to fulfill that operation. Gas fees are paid entirely in Ether (ETH), which is the native coin of the blockchain. The price of gas can fluctuate from time to time depending on the network demand."
  },
  {
    "id": "tether",
    "symbol": "usdt",
    "name": "Tether",
    "image": "https://assets.coingecko.com/coins/images/325/large/Tether-logo.png?1598003707",
    "current_price": 0.884238,
    "market_cap": 60128668126,
    "market_cap_rank": 3,
    "fully_diluted_valuation": 7072955648,
    "total_volume": 49291538175,
    "high_24h": 0.893908,
    "low_24h": 0.878575,
    "price_change_24h": 0.00165659,
    "price_change_percentage_24h": 0.1877,
    "market_cap_change_24h": 173006780,
    "market_cap_change_percentage_24h": 0.28856,
    "circulating_supply": 67969594332.2375,
    "total_supply": 67969594332.2375,
    "max_supply": null,
    "ath": 1.01,
    "ath_change_percentage": -12.43393,
    "ath_date": "2018-07-24T00:00:00.000Z",
    "atl": 0.388017,
    "atl_change_percentage": 127.92948,
    "atl_date": "2015-03-02T00:00:00.000Z",
    "roi": null,
    "last_updated": "2022-09-22T10:31:13.824Z",
    "coin_description": "Tether (USDT) is a cryptocurrency with a value meant to mirror the value of the U.S. dollar. The idea was to create a stable cryptocurrency that can be used like digital dollars. Coins that serve this purpose of being a stable dollar substitute are called “stable coins.” Tether is the most popular stable coin and even acts as a dollar replacement on many popular exchanges! According to their site, Tether converts cash into digital currency, to anchor or “tether” the value of the coin to the price of national currencies like the US dollar, the Euro, and the Yen. Like other cryptos it uses blockchain. Unlike other cryptos, it is [according to the official Tether site] “100% backed by USD” (USD is held in reserve). The primary use of Tether is that it offers some stability to the otherwise volatile crypto space and offers liquidity to exchanges who can’t deal in dollars and with banks (for example to the sometimes controversial but leading exchange Bitfinex). The digital coins are issued by a company called Tether Limited that is governed by the laws of the British Virgin Islands, according to the legal part of its website. It is incorporated in Hong Kong. It has emerged that Jan Ludovicus van der Velde is the CEO of cryptocurrency exchange Bitfinex, which has been accused of being involved in the price manipulation of bitcoin, as well as tether. Many people trading on exchanges, including Bitfinex, will use tether to buy other cryptocurrencies like bitcoin. Tether Limited argues that using this method to buy virtual currencies allows users to move fiat in and out of an exchange more quickly and cheaply. Also, exchanges typically have rocky relationships with banks, and using Tether is a way to circumvent that. USDT is fairly simple to use. Once on exchanges like Poloniex or Bittrex, it can be used to purchase Bitcoin and other cryptocurrencies. It can be easily transferred from an exchange to any Omni Layer enabled wallet. Tether has no transaction fees, although external wallets and exchanges may charge one. In order to convert USDT to USD and vise versa through the Tether.to Platform, users must pay a small fee. Buying and selling Tether for Bitcoin can be done through a variety of exchanges like the ones mentioned previously or through the Tether.to platform, which also allows the conversion between USD to and from your bank account."
  },
  {
    "id": "usd-coin",
    "symbol": "usdc",
    "name": "USD Coin",
    "image": "https://assets.coingecko.com/coins/images/6319/large/USD_Coin_icon.png?1547042389",
    "current_price": 0.884181,
    "market_cap": 44152603995,
    "market_cap_rank": 4,
    "fully_diluted_valuation": 19654958334,
    "total_volume": 5394077690,
    "high_24h": 0.895106,
    "low_24h": 0.875889,
    "price_change_24h": 0.00464375,
    "price_change_percentage_24h": 0.52798,
    "market_cap_change_24h": 47781571,
    "market_cap_change_percentage_24h": 0.10834,
    "circulating_supply": 49936158932.5205,
    "total_supply": 49935482525.291,
    "max_supply": null,
    "ath": 0.919814,
    "ath_change_percentage": -3.67438,
    "ath_date": "2020-03-13T02:35:16.858Z",
    "atl": 0.629869,
    "atl_change_percentage": 40.66675,
    "atl_date": "2021-05-19T13:14:05.611Z",
    "roi": null,
    "last_updated": "2022-09-22T10:34:25.963Z",
    "coin_description": "USDC is a fully collateralized US dollar stablecoin. USDC is the bridge between dollars and trading on cryptocurrency exchanges. The technology behind CENTRE makes it possible to exchange value between people, businesses and financial institutions just like email between mail services and texts between SMS providers. We believe by removing artificial economic borders, we can create a more inclusive global economy."
  },
  {
    "id": "binancecoin",
    "symbol": "bnb",
    "name": "BNB",
    "image": "https://assets.coingecko.com/coins/images/825/large/bnb-icon2_2x.png?1644979850",
    "current_price": 237.35,
    "market_cap": 38753889114,
    "market_cap_rank": 5,
    "fully_diluted_valuation": 39190563289,
    "total_volume": 708346560,
    "high_24h": 243.52,
    "low_24h": 232.43,
    "price_change_24h": 2.01,
    "price_change_percentage_24h": 0.85607,
    "market_cap_change_24h": 263470568,
    "market_cap_change_percentage_24h": 0.68451,
    "circulating_supply": 163276974.63,
    "total_supply": 163276974.63,
    "max_supply": 165116760.0,
    "ath": 497.18,
    "ath_change_percentage": -52.28471,
    "ath_date": "2021-11-07T10:13:53.906Z",
    "atl": 0.03027451,
    "atl_change_percentage": 783498.18316,
    "atl_date": "2017-10-19T00:00:00.000Z",
    "roi": null,
    "last_updated": "2022-09-22T10:33:44.097Z",
    "coin_description": "Binance Coin is the cryptocurrency of the Binance platform. It is a trading platform exclusively for cryptocurrencies. The name Binance is a combination of binary and finance. Thus, the startup name shows that only cryptocurrencies can be traded against each other. It is not possible to trade crypto currencies against Fiat. The platform achieved an enormous success within a very short time and is focused on worldwide market with Malta headquarters. The cryptocurrency currently has a daily trading volume of 1.5 billion - 2 billion US dollars and is still increasing. In total, there will only be 200 million BNBs. Binance uses the ERC20 token standard from Ethereum and has distributed it as follow: 50% sold on ICO, 40% to the team and 10% to Angel investors. The coin can be used to pay fees on Binance. These include trading fees, transaction fees, listing fees and others. Binance gives you a huge discount when fees are paid in BNB. The schedule of BNB fees discount is as follow: In the first year, 50% discount on all fees, second year 25% discount, third year 12.5% discount, fourth year 6.75 % discount, and from the fifth year onwards there is no discount. This structure is used to incentivize users to buy BNB and do trades within Binance. Binance announced in a buyback plan that it would buy back up to 100 million BNB in Q1 2018. The coins are then burned. This means that they are devaluated to increase the value of the remaining coins. This benefits investors. In the future, the cryptocurrency will remain an asset on the trading platform and will be used as gas. Other tokens that are issued by exchanges include Bibox Token, OKB, Huobi Token, and more."
  },
  {
    "id": "ripple",
    "symbol": "xrp",
    "name": "XRP",
    "image": "https://assets.coingecko.com/coins/images/44/large/xrp-symbol-white-128.png?1605778731",
    "current_price": 0.378147,
    "market_cap": 18841746310,
    "market_cap_rank": 6,
    "fully_diluted_valuation": 37797832974,
    "total_volume": 2802493647,
    "high_24h": 0.380076,
    "low_24h": 0.345858,
    "price_change_24h": 0.02257539,
    "price_change_percentage_24h": 6.34904,
    "market_cap_change_24h": 1021831205,
    "market_cap_change_percentage_24h": 5.73421,
    "circulating_supply": 49848747475.0,
    "total_supply": 99989294935.0,
    "max_supply": 100000000000.0,
    "ath": 2.5,
    "ath_change_percentage": -84.9681,
    "ath_date": "2018-01-07T00:00:00.000Z",
    "atl": 0.00159246,
    "atl_change_percentage": 23529.62857,
    "atl_date": "2014-05-22T00:00:00.000Z",
    "roi": null,
    "last_updated": "2022-09-22T10:35:02.742Z",
    "coin_description": "Ripple is the catchall name for the cryptocurrency platform, the transactional protocol for which is actually XRP, in the same fashion as Ethereum is the name for the platform that facilitates trades in Ether. Like other cryptocurrencies, Ripple is built atop the idea of a distributed ledger network which requires various parties to participate in validating transactions, rather than any singular centralized authority. That facilitates transactions all over the world, and transfer fees are far cheaper than the likes of bitcoin. Unlike other cryptocurrencies, XRP transfers are effectively immediate, requiring no typical confirmation time. Ripple was originally founded by a single company, Ripple Labs, and continues to be backed by it, rather than the larger network of developers that continue bitcoin’s development. It also doesn’t have a fluctuating amount of its currency in existence. Where bitcoin has a continually growing pool with an eventual maximum, and Ethereum theoretically has no limit, Ripple was created with all of its 100 billion XRP tokens right out of the gate. That number is maintained with no mining and most of the tokens are owned and held by Ripple Labs itself — around 60 billion at the latest count. Even at the recently reduced value of around half a dollar per XRP, that means Ripple Labs is currently sitting on around $20 billion worth of the cryptocurrency (note: Ripple’s price crashed hard recently, and may be worth far less than $60 billion by time you read this). It holds 55 billion XRP in an escrow account, which allows it to sell up to a billion per month if it so chooses in order to fund new projects and acquisitions. Selling such an amount would likely have a drastic effect on the cryptocurrency’s value, and isn’t something Ripple Labs plans to do anytime soon. In actuality, Ripple Labs is looking to leverage the technology behind XRP to allow for faster banking transactions around the world. While Bitcoin and other cryptocurrencies are built on the idea of separating financial transactions from the financial organizations of traditional currencies, Ripple is almost the opposite in every sense. XRP by Ripple price can be found on this page alongside the market capitalization and additional stats."
  },
  {
    "id": "binance-usd",
    "symbol": "busd",
    "name": "Binance USD",
    "image": "https://assets.coingecko.com/coins/images/9576/large/BUSD.png?1568947766",
    "current_price": 0.885567,
    "market_cap": 18613715218,
    "market_cap_rank": 7,
    "fully_diluted_valuation": 10275753274,
    "total_volume": 9261807808,
    "high_24h": 0.896678,
    "low_24h": 0.877624,
    "price_change_24h": 0.00370288,
    "price_change_percentage_24h": 0.41989,
    "market_cap_change_24h": 98317984,
    "market_cap_change_percentage_24h": 0.53101,
    "circulating_supply": 21032847703.28,
    "total_supply": 21054027591.5,
    "max_supply": null,
    "ath": 0.91953,
    "ath_change_percentage": -3.74933,
    "ath_date": "2020-03-13T02:35:42.953Z",
    "atl": 0.636805,
    "atl_change_percentage": 38.9835,
    "atl_date": "2021-05-19T13:04:37.445Z",
    "roi": null,
    "last_updated": "2022-09-22T10:34:39.775Z",
    "coin_description": "USDC is a fully collateralized US dollar stablecoin. USDC is the bridge between dollars and trading on cryptocurrency exchanges. The technology behind CENTRE makes it possible to exchange value between people, businesses and financial institutions just like email between mail services and texts between SMS providers. We believe by removing artificial economic borders, we can create a more inclusive global economy."
  },
  {
    "id": "cardano",
    "symbol": "ada",
    "name": "Cardano",
    "image": "https://assets.coingecko.com/coins/images/975/large/cardano.png?1547034860",
    "current_price": 0.403736,
    "market_cap": 13625052485,
    "market_cap_rank": 8,
    "fully_diluted_valuation": 18128994742,
    "total_volume": 767029963,
    "high_24h": 0.4085,
    "low_24h": 0.383948,
    "price_change_24h": 0.00667315,
    "price_change_percentage_24h": 1.68063,
    "market_cap_change_24h": 165755810,
    "market_cap_change_percentage_24h": 1.23153,
    "circulating_supply": 33820262543.95,
    "total_supply": 45000000000.0,
    "max_supply": 45000000000.0,
    "ath": 2.24,
    "ath_change_percentage": -82.03449,
    "ath_date": "2021-09-02T06:00:10.474Z",
    "atl": 0.01534983,
    "atl_change_percentage": 2522.7335,
    "atl_date": "2020-03-13T02:22:55.044Z",
    "roi": null,
    "last_updated": "2022-09-22T10:35:15.202Z",
    "coin_description": "Cardano is one of the biggest cryptocurrencies by market cap. It’s designed to be a flexible, sustainable, and scalable blockchain platform for running smart contracts — which will allow the development of a wide range of decentralized finance apps, new crypto tokens, games, and more. As of March 2021, however, smart-contract functionality has yet to be rolled out by developers. An upgrade scheduled for the second quarter of 2021 will unlock smart-contract features, bringing Cardano one step closer to its goal of providing developers with a blockchain platform that is robust, secure, scalable, and highly energy-efficient. Much like the Ethereum blockchain’s native cryptocurrency is ETH, the Cardano blockchain’s native cryptocurrency is ADA — which can be bought or sold via exchanges like Coinbase. Today, ADA can be used to store value (perhaps as part of your investment portfolio), to send and receive payments, and for staking and paying transaction fees on the Cardano network."
  },
  {
    "id": "solana",
    "symbol": "sol",
    "name": "Solana",
    "image": "https://assets.coingecko.com/coins/images/4128/large/solana.png?1640133422",
    "current_price": 28.58,
    "market_cap": 10088121310,
    "market_cap_rank": 9,
    "fully_diluted_valuation": 24710348911,
    "total_volume": 1167767776,
    "high_24h": 29.42,
    "low_24h": 26.89,
    "price_change_24h": 0.706605,
    "price_change_percentage_24h": 2.53496,
    "market_cap_change_24h": 211337754,
    "market_cap_change_percentage_24h": 2.13974,
    "circulating_supply": 354522475.790257,
    "total_supply": 508180963.57,
    "max_supply": null,
    "ath": 192.59,
    "ath_change_percentage": -85.22804,
    "ath_date": "2021-11-06T21:54:35.825Z",
    "atl": 0.406099,
    "atl_change_percentage": 6905.54075,
    "atl_date": "2020-05-11T19:35:23.449Z",
    "roi": null,
    "last_updated": "2022-09-22T10:35:05.786Z",
    "coin_description": "Solana is a highly functional open source project that banks on blockchain technology’s permissionless nature to provide decentralized finance (DeFi) solutions. It is a layer 1 network that offers fast speeds and affordable costs. While the idea and initial work on the project began in 2017, Solana was officially launched in March 2020 by the Solana Foundation with headquarters in Geneva, Switzerland."
  },
  {
    "id": "dogecoin",
    "symbol": "doge",
    "name": "Dogecoin",
    "image": "https://assets.coingecko.com/coins/images/5/large/dogecoin.png?1547792256",
    "current_price": 0.052202,
    "market_cap": 6925707943,
    "market_cap_rank": 10,
    "fully_diluted_valuation": 8581634866,
    "total_volume": 328770634,
    "high_24h": 0.053678,
    "low_24h": 0.050022,
    "price_change_24h": 0.00040322,
    "price_change_percentage_24h": 0.77842,
    "market_cap_change_24h": 54130388,
    "market_cap_change_percentage_24h": 0.78774,
    "circulating_supply": 132670764299.894,
    "total_supply": null,
    "max_supply": null,
    "ath": 0.523116,
    "ath_change_percentage": -90.0408,
    "ath_date": "2021-05-08T05:08:23.458Z",
    "atl": 5.701e-5,
    "atl_change_percentage": 91281.52858,
    "atl_date": "2015-05-06T00:00:00.000Z",
    "roi": null,
    "last_updated": "2022-09-22T10:34:56.222Z",
    "coin_description": "Dogecoin is a cryptocurrency based on the popular Doge Internet meme and features a Shiba Inu on its logo. Dogecoin is a Litecoin fork. Introduced as a joke currency on 6 December 2013, Dogecoin quickly developed its own online community and reached a capitalization of US$60 million in January 2014. Compared with other cryptocurrencies, Dogecoin had a fast initial coin production schedule: 100 billion coins were in circulation by mid-2015, with an additional 5.256 billion coins every year thereafter. As of 30 June 2015, the 100 billionth Dogecoin had been mined. Dogecoin was created by Billy Markus from Portland, Oregon and Jackson Palmer from Sydney, Australia. Both wanted to create a fun cryptocurrency that will appeal beyond the core Bitcoin audience. Dogecoin is primarily used as a tipping system on Reddit and Twitter where users tip each other for creating or sharing good content. The community is very active in organising fundraising activities for deserving causes. The developers of Dogecoin haven’t made any major changes to the coin since 2015. This means that Dogecoin could get left behind and is why Shibas are leaving Dogecoin to join more advanced platforms like Ethereum. One of Dogecoin strengths is its relaxed and fun-loving community. However, this is also a weakness because other currencies are way more professional. To purchase Dogecoin, it involves downloading a crypto wallet, setting up a crypto exchange account and then trading away for your desired crypto currency. Once we have set up an account with a DOGE currency exchange and deposited some funds, you are ready to start trading."
  }
]
