[
  {
    "symbol": "btc",
    "name": "Bitcoin",
    "image": "https://assets.coingecko.com/coins/images/1/large/bitcoin.png?1547033579",
    "current_price": 16962.21,
    "market_cap": 324718794812,
    "market_cap_rank": 1,
    "fully_diluted_valuation": 355947584982,
    "total_volume": 42279110530,
    "high_24h": 17388.04,
    "low_24h": 16201.1,
    "circulating_supply": 19157581.0,
    "total_supply": 21000000.0,
    "max_supply": 21000000.0,
    "ath": 51032,
    "atl": 43.9,
    "coin_description": "Bitcoin is the first successful internet money based on peer-to-peer technology; whereby no central bank or authority is involved in the transaction and production of the Bitcoin currency. It was created by an anonymous individual/group under the name, Satoshi Nakamoto. The source code is available publicly as an open source project, anybody can look at it and be part of the developmental process. Bitcoin is changing the way we see money as we speak. The idea was to produce a means of exchange, independent of any central authority, that could be transferred electronically in a secure, verifiable and immutable way. It is a decentralized peer-to-peer internet currency making mobile payment easy, very low transaction fees, protects your identity, and it works anywhere all the time with no central authority and banks.",
    "key": "",
    "index": 0,
    "coindesc": ""
  },

  {
    "symbol": "eth",
    "name": "Ethereum",
    "image": "https://assets.coingecko.com/coins/images/279/large/ethereum.png?1595348880",
    "current_price": 1146.41,
    "market_cap": 137681214772,
    "market_cap_rank": 2,
    "fully_diluted_valuation": 205079023238,
    "total_volume": 18800844298,
    "high_24h": 1219.67,
    "low_24h": 1093.32,
    "circulating_supply": 120626085.662685,
    "total_supply": 120626085.662685,
    "max_supply": null,
    "ath": 3610.11,
    "atl": 0.280314,
    "coin_description": "Ethereum is a global, open-source platform for decentralized applications. In other words, the vision is to create a world computer that anyone can build applications in a decentralized manner; while all states and data are distributed and publicly accessible. Ethereum supports smart contracts in which developers can write code in order to program digital value. Examples of decentralized apps (dapps) that are built on Ethereum includes tokens, non-fungible tokens, decentralized finance apps, lending protocol, decentralized exchanges, and much more. On Ethereum, all transactions and smart contract executions require a small fee to be paid. This fee is called Gas. In technical terms, Gas refers to the unit of measure on the amount of computational effort required to execute an operation or a smart contract.",
    "key": "",
    "index": 1,
    "coindesc": ""
  },
  {
    "symbol": "usdt",
    "name": "Tether",
    "image": "https://assets.coingecko.com/coins/images/325/large/Tether-logo.png?1598003707",
    "current_price": 0.884238,
    "market_cap": 60128668126,
    "market_cap_rank": 3,
    "fully_diluted_valuation": 7072955648,
    "total_volume": 49291538175,
    "high_24h": 0.893908,
    "low_24h": 0.878575,
    "circulating_supply": 67969594332.2375,
    "total_supply": 67969594332.2375,
    "max_supply": null,
    "ath": 1.01,
    "atl": 0.388017,
    "coin_description": "Tether (USDT) is a cryptocurrency with a value meant to mirror the value of the U.S. dollar. The idea was to create a stable cryptocurrency that can be used like digital dollars. Coins that serve this purpose of being a stable dollar substitute are called “stable coins.” Tether is the most popular stable coin and even acts as a dollar replacement on many popular exchanges! According to their site, Tether converts cash into digital currency, to anchor or “tether” the value of the coin to the price of national currencies like the US dollar, the Euro, and the Yen. Like other cryptos it uses blockchain. Unlike other cryptos, it is [according to the official Tether site] “100% backed by USD” (USD is held in reserve). The primary use of Tether is that it offers some stability to the otherwise volatile crypto space and offers liquidity to exchanges who can’t deal in dollars and with banks (for example to the sometimes controversial but leading exchange Bitfinex).",
    "key": "",
    "index": 2,
    "coindesc": ""
  },
  {
    "symbol": "trx",
    "name": "TRON",
    "image": "https://assets.coingecko.com/coins/images/1094/large/tron-logo.png?1696502193",
    "current_price": 1089.0883,
    "market_cap": 106772126288,
    "market_cap_rank": 4,
    "fully_diluted_valuation": 7767735592,
    "total_volume": 238217034,
    "high_24h": 0.090255,
    "low_24h": 0.088027,
    "circulating_supply": 88143811783.7654,
    "total_supply": 88143974399.1166,
    "max_supply": null,
    "ath": 0.170763,
    "atl": 0.00137147,
    "coin_description": "Tron is a blockchain-based decentralized digital platform with its own cryptocurrency, called Tronix or TRX. Founded in 2017 by a Singapore non-profit organization, the Tron Foundation, Tron aims to host a global entertainment system for the cost-effective sharing of digital content.Initially marketed primarily in Asia, Tron had now gone global. The platform had about 180 million accounts as of August 2023.    Founded by Justin Sun, now its CEO, Tron has offices in Singapore and San Francisco. Born in 1990, Sun also is the CEO of BitTorrent, the file-sharing program. Tron uses the features of the blockchain and peer-to-peer (P2P) network technology to eliminate the middleman and allow content creators to sell their work directly to consumers. Software developers use the Solidity programming language to create apps that are hosted on the Tron platform.",
    "key": "",
    "index": 3,
    "coindesc": ""
  },
  {
    "symbol": "bnb",
    "name": "BNB",
    "image": "https://assets.coingecko.com/coins/images/825/large/bnb-icon2_2x.png?1644979850",
    "current_price": 237.35,
    "market_cap": 38753889114,
    "market_cap_rank": 5,
    "fully_diluted_valuation": 39190563289,
    "total_volume": 708346560,
    "high_24h": 243.52,
    "low_24h": 232.43,
    "circulating_supply": 163276974.63,
    "total_supply": 163276974.63,
    "max_supply": 165116760.0,
    "ath": 497.18,
    "atl": 0.03027451,
    "coin_description": "Binance Coin is the cryptocurrency of the Binance platform. It is a trading platform exclusively for cryptocurrencies. The name Binance is a combination of binary and finance. Thus, the startup name shows that only cryptocurrencies can be traded against each other. It is not possible to trade crypto currencies against Fiat. The platform achieved an enormous success within a very short time and is focused on worldwide market with Malta headquarters. The cryptocurrency currently has a daily trading volume of 1.5 billion - 2 billion US dollars and is still increasing. In total, there will only be 200 million BNBs. Binance uses the ERC20 token standard from Ethereum and has distributed it as follow: 50% sold on ICO, 40% to the team and 10% to Angel investors. The coin can be used to pay fees on Binance. These include trading fees, transaction fees, listing fees and others. Binance gives you a huge discount when fees are paid in BNB.",
    "key": "",
    "index": 4,
    "coindesc": ""
  },
  {
    "symbol": "xrp",
    "name": "XRP",
    "image": "https://assets.coingecko.com/coins/images/44/large/xrp-symbol-white-128.png?1605778731",
    "current_price": 0.378147,
    "market_cap": 18841746310,
    "market_cap_rank": 6,
    "fully_diluted_valuation": 37797832974,
    "total_volume": 2802493647,
    "high_24h": 0.380076,
    "low_24h": 0.345858,
    "circulating_supply": 49848747475.0,
    "total_supply": 99989294935.0,
    "max_supply": 100000000000.0,
    "ath": 2.5,
    "atl": 0.00159246,
    "coin_description": "Ripple is the catchall name for the cryptocurrency platform, the transactional protocol for which is actually XRP, in the same fashion as Ethereum is the name for the platform that facilitates trades in Ether. Like other cryptocurrencies, Ripple is built atop the idea of a distributed ledger network which requires various parties to participate in validating transactions, rather than any singular centralized authority. That facilitates transactions all over the world, and transfer fees are far cheaper than the likes of bitcoin. Unlike other cryptocurrencies, XRP transfers are effectively immediate, requiring no typical confirmation time. Ripple was originally founded by a single company, Ripple Labs, and continues to be backed by it, rather than the larger network of developers that continue bitcoin’s development. It also doesn’t have a fluctuating amount of its currency in existence.",
    "key": "",
    "index": 5,
    "coindesc": ""
  },
  {
    "symbol": "dot",
    "name": "Polkadot",
    "image": "https://assets.coingecko.com/coins/images/12171/large/polkadot.png?1696512008",
    "current_price": 5.47,
    "market_cap": 7232427802,
    "market_cap_rank": 7,
    "fully_diluted_valuation": 7674406664,
    "total_volume": 278689775,
    "high_24h": 5.73,
    "low_24h": 5.3,
    "circulating_supply": 1324630680.72846,
    "total_supply": 1405579813.86768,
    "max_supply": null,
    "ath": 40.66,
    "atl": 2.05,
    "coin_description": "Polkadot enables cross-blockchain transfers of any type of data or asset, not just tokens. Connecting to Polkadot gives you the ability to interoperate with a wide variety of blockchains in the Polkadot network. Polkadot provides unprecedented economic scalability by enabling a common set of validators to secure multiple blockchains. Polkadot provides transactional scalability by spreading transactions across multiple parallel blockchains. Create a custom blockchain in minutes using the Substrate framework. Connect your chain to Polkadot and get interoperability and security from day one. This ease of development helps Polkadot’s network grow.",
    "key": "",
    "index": 6,
    "coindesc": ""
  },
  {
    "symbol": "ada",
    "name": "Cardano",
    "image": "https://assets.coingecko.com/coins/images/975/large/cardano.png?1547034860",
    "current_price": 0.403736,
    "market_cap": 13625052485,
    "market_cap_rank": 8,
    "fully_diluted_valuation": 18128994742,
    "total_volume": 767029963,
    "high_24h": 0.4085,
    "low_24h": 0.383948,
    "circulating_supply": 33820262543.95,
    "total_supply": 45000000000.0,
    "max_supply": 45000000000.0,
    "ath": 2.24,
    "atl": 0.01534983,
    "coin_description": "Cardano is one of the biggest cryptocurrencies by market cap. It’s designed to be a flexible, sustainable, and scalable blockchain platform for running smart contracts — which will allow the development of a wide range of decentralized finance apps, new crypto tokens, games, and more. As of March 2021, however, smart-contract functionality has yet to be rolled out by developers. An upgrade scheduled for the second quarter of 2021 will unlock smart-contract features, bringing Cardano one step closer to its goal of providing developers with a blockchain platform that is robust, secure, scalable, and highly energy-efficient. Much like the Ethereum blockchain’s native cryptocurrency is ETH, the Cardano blockchain’s native cryptocurrency is ADA — which can be bought or sold via exchanges like Coinbase. Today, ADA can be used to store value (perhaps as part of your investment portfolio), to send and receive payments, and for staking and paying transaction fees on the Cardano network.",
    "key": "",
    "index": 7,
    "coindesc": ""
  },
  {
    "symbol": "sol",
    "name": "Solana",
    "image": "https://assets.coingecko.com/coins/images/4128/large/solana.png?1640133422",
    "current_price": 28.58,
    "market_cap": 10088121310,
    "market_cap_rank": 9,
    "fully_diluted_valuation": 24710348911,
    "total_volume": 1167767776,
    "high_24h": 29.42,
    "low_24h": 26.89,
    "circulating_supply": 354522475.790257,
    "total_supply": 508180963.57,
    "max_supply": null,
    "ath": 192.59,
    "atl": 0.406099,
    "coin_description": "Solana is a highly functional open source project that banks on blockchain technology’s permissionless nature to provide decentralized finance (DeFi) solutions. While the idea and initial work on the project began in 2017, Solana was officially launched in March 2020 by the Solana Foundation with headquarters in Geneva, Switzerland. The Solana protocol is designed to facilitate decentralized app (DApp) creation. It aims to improve scalability by introducing a proof-of-history (PoH) consensus combined with the underlying proof-of-stake (PoS) consensus of the blockchain. Because of the innovative hybrid consensus model, Solana enjoys interest from small-time traders and institutional traders alike. A significant focus for the Solana Foundation is to make decentralized finance accessible on a larger scale.",
    "key": "",
    "index": 8,
    "coindesc": ""
  },
  {
    "symbol": "doge",
    "name": "Dogecoin",
    "image": "https://assets.coingecko.com/coins/images/5/large/dogecoin.png?1547792256",
    "current_price": 0.052202,
    "market_cap": 6925707943,
    "market_cap_rank": 10,
    "fully_diluted_valuation": 8581634866,
    "total_volume": 328770634,
    "high_24h": 0.053678,
    "low_24h": 0.050022,
    "circulating_supply": 132670764299.894,
    "total_supply": null,
    "max_supply": null,
    "ath": 0.523116,
    "atl": 0.7015,
    "coin_description": "Dogecoin is a cryptocurrency based on the popular Doge Internet meme and features a Shiba Inu on its logo. Dogecoin is a Litecoin fork. Introduced as a joke currency on 6 December 2013, Dogecoin quickly developed its own online community and reached a capitalization of US$60 million in January 2014. Compared with other cryptocurrencies, Dogecoin had a fast initial coin production schedule: 100 billion coins were in circulation by mid-2015, with an additional 5.256 billion coins every year thereafter. As of 30 June 2015, the 100 billionth Dogecoin had been mined. Dogecoin was created by Billy Markus from Portland, Oregon and Jackson Palmer from Sydney, Australia. Both wanted to create a fun cryptocurrency that will appeal beyond the core Bitcoin audience. Dogecoin is primarily used as a tipping system on Reddit and Twitter where users tip each other for creating or sharing good content. The community is very active in organising fundraising activities for deserving causes.",
    "key": "",
    "index": 9,
    "coindesc": ""
  },
  {
    "symbol": "matic",
    "name": "Polygon",
    "image": "https://assets.coingecko.com/coins/images/4713/large/polygon.png?1698233745",
    "current_price": 0.771714,
    "market_cap": 7153312624,
    "market_cap_rank": 11,
    "fully_diluted_valuation": 7705866758,
    "total_volume": 290967903,
    "high_24h": 0.771892,
    "low_24h": 0.728441,
    "circulating_supply": 9282943566.203985,
    "total_supply": 10000000000,
    "max_supply": 10000000000,
    "ath": 2.18,
    "atl": 0.00241648,
    "coin_description": "Polygon (formerly Matic Network) is a blockchain platform which aims to create a multi-chain blockchain system compatible with Ethereum. As with Ethereum, it uses a proof-of-stake consensus mechanism for processing transactions on-chain. Polygon's native token is named MATIC. Matic is an ERC-20 token, allowing for compatibility with other Ethereum cryptocurrencies.Polygon is used in decentralized applications (dApps) such as Defi, DAOs, and NFTs. The Matic Network was launched in 2017 by four Mumbai-based software engineers: Jaynti Kanani, Sandeep Nailwal, Anurag Arjun, and Mihailo Bjelic. In February 2021, the project rebranded into Polygon Technology. In December 2021, Polygon acquired the Mir blockchain network for 250 Million MATIC tokens (about $400M at the time of the deal). ZK-rollups were intended to offload data from Ethereum to reduce fees and speed-up the transaction process while maintaining security",
    "key": "",
    "index": 10,
    "coindesc": ""
  },
  {
    "symbol": "ton",
    "name": "Toncoin",
    "image": "https://assets.coingecko.com/coins/images/17980/large/ton_symbol.png?1696517498",
    "current_price": 1.81,
    "market_cap": 6280092545,
    "market_cap_rank": 12,
    "fully_diluted_valuation": 9243128452,
    "total_volume": 16842047,
    "high_24h": 1.82,
    "low_24h": 1.74,
    "circulating_supply": 3467054512.78882,
    "total_supply": 5102859549.01239,
    "max_supply": null,
    "ath": 3.96,
    "atl": 0.380291,
    "coin_description": "The Open Network (previously Telegram Open Network, both abb. as TON) is a decentralized computer network consisting of a layer-1 blockchain with various components. TON was originally developed by Dr. Nikolai Durov and the messaging platform, Telegram and now embraced by a global community of independent contributors. In 2017-2018, the Telegram Messenger team is starting to explore blockchain solutions for themselves. Finding no current Layer 1 blockchain able to support Telegram's 9-figure userbase, they decide to design their own layer-1 chain, then called Telegram Open Network. According to documents related to U.S. Securities and Exchange Commission (SEC) v. Telegram suit (2020), by 2017, the self-funded startup needed money to pay for servers and services.",
    "key": "",
    "index": 11,
    "coindesc": ""
  },
  {
    "symbol": "uni",
    "name": "Uniswap",
    "image": "https://assets.coingecko.com/coins/images/12504/large/uni.jpg?1696512319",
    "current_price": 6.07,
    "market_cap": 4570788098,
    "market_cap_rank": 13,
    "fully_diluted_valuation": 6063929726,
    "total_volume": 109282515,
    "high_24h": 6.31,
    "low_24h": 6,
    "circulating_supply": 753766667,
    "total_supply": 1000000000,
    "max_supply": 1000000000,
    "ath": 32.53,
    "atl": 0.796343,
    "coin_description": "Uniswap is a decentralized cryptocurrency exchange that uses a set of smart contracts (liquidity pools) to execute trades. It is an open source project and falls into the category of a DeFi product (Decentralized finance) because it uses smart contracts to facilitate trades. The protocol facilitates automated transactions between cryptocurrency tokens on the Ethereum blockchain through the use of smart contracts. As of October 2020, Uniswap was estimated to be the largest decentralized exchange and the fourth-largest cryptocurrency exchange overall by daily trading volume. Uniswap was created on November 2, 2018 by Hayden Adams, a former mechanical engineer at Siemens.",
    "key": "",
    "index": 12,
    "coindesc": ""
  },
  {
    "symbol": "tao",
    "name": "Bittensor",
    "image": "https://assets.coingecko.com/coins/images/28452/large/ARUsPeNQ_400x400.jpeg?1696527447",
    "current_price": 511.87,
    "market_cap": 3207406886,
    "market_cap_rank": 14,
    "fully_diluted_valuation": 10742728696,
    "total_volume": 15990812,
    "high_24h": 526.49,
    "low_24h": 499.18,
    "circulating_supply": 6269873,
    "total_supply": 21000000,
    "max_supply": 21000000,
    "ath": 555.3,
    "atl": 24.74,
    "coin_description": "Bittensor is an open-source protocol that powers a decentralized, blockchain-based machine learning network. Machine learning models train collaboratively and are rewarded in TAO according to the informational value they offer the collective. TAO also grants external access, allowing users to extract information from the network while tuning its activities to their needs. Ultimately, our vision is to create a pure market for artificial intelligence, an incentivized arena in which consumers and producers of this valuable commodity can interact in a trustless, open and transparent context.",
    "key": "",
    "index": 13,
    "coindesc": ""
  },
  {
    "symbol": "ltc",
    "name": "Litecoin",
    "image": "https://assets.coingecko.com/coins/images/2/large/litecoin.png?1696501400",
    "current_price": 56.13,
    "market_cap": 4166067436,
    "market_cap_rank": 15,
    "fully_diluted_valuation": 4715038484,
    "total_volume": 173495651,
    "high_24h": 56.12,
    "low_24h": 55.17,
    "circulating_supply": 74219895.7334713,
    "total_supply": 84000000,
    "max_supply": 84000000,
    "ath": 292.64,
    "atl": 0.759508,
    "coin_description": "Litecoin (LTC) is an alternative cryptocurrency created in October 2011 by Charles Lee, a former Google engineer. Litecoin was adapted from Bitcoin's open-source code but with several modifications. Like Bitcoin, Litecoin is based on an open-source global payment network that is not controlled by any central authority. Litecoin differs from Bitcoin in aspects like faster block generation rate and use of Scrypt (pronounced es-scrypt) as a proof of work scheme. Litecoin is considered to be among the first altcoins, derived from Bitcoin's original open-source code. Initially, it was a strong competitor to Bitcoin. However, as the cryptocurrency market has become more saturated and competitive, Litecoin's popularity has waned somewhat. Litecoin has always been viewed as a reaction to Bitcoin.",
    "key": "",
    "index": 14,
    "coindesc": ""
  },
  {
    "symbol": "dai",
    "name": "Dai",
    "image": "https://assets.coingecko.com/coins/images/9956/large/Badge_Dai.png?1696509996",
    "current_price": 0.793669,
    "market_cap": 3906143326,
    "market_cap_rank": 16,
    "fully_diluted_valuation": 3906143326,
    "total_volume": 70239481,
    "high_24h": 0.797613,
    "low_24h": 0.791714,
    "circulating_supply": 4921627042.2078,
    "total_supply": 4921627042.2078,
    "max_supply": null,
    "ath": 0.973295,
    "atl": 0.655065,
    "coin_description": "DAI is an Ethereum-based stablecoin (stable-price cryptocurrency) whose issuance and development is managed by the Maker Protocol and the MakerDAO decentralized autonomous organization. The price of DAI is soft-pegged to the U.S. dollar and is collateralized by a mix of other cryptocurrencies that are deposited into smart-contract vaults every time new DAI is minted. It is important to differentiate between Multi-Collateral DAI and Single-Collateral DAI (SAI), an earlier version of the token that could only be collateralized by a single cryptocurrency; SAI also doesn’t support the DAI Savings Rate, which allows users to earn savings by holding DAI tokens. Multi-Collateral DAI was launched in November 2019.",
    "key": "",
    "index": 15,
    "coindesc": ""
  },
  {
    "symbol": "imx",
    "name": "Immutable",
    "image": "https://assets.coingecko.com/coins/images/17233/large/immutableX-symbol-BLK-RGB.png?1696516787",
    "current_price": 2.67,
    "market_cap": 3625560683,
    "market_cap_rank": 17,
    "fully_diluted_valuation": 5349685904,
    "total_volume": 77817088,
    "high_24h": 2.68,
    "low_24h": 2.43,
    "circulating_supply": 1355429364.3898141,
    "total_supply": 2000000000,
    "max_supply": 2000000000,
    "ath": 7.15,
    "atl": 0.312494,
    "coin_description": "Immutable positions itself as the first layer-two scaling solution for NFTs on Ethereum. According to Immutable, its blockchain does away with Ethereum’s limitations like low scalability, a poor user experience, illiquidity, and a slow developer experience. Instead, users benefit from instant trading and massive scalability while enjoying zero gas fees for minting and trading NFTs without compromising user or asset security.Thanks to this technology, users will be able to create and distribute assets like ERC-20 and ERC-721 tokens on a massive scale. Chris Clay, the game Director of Gods Unchained, a project already building on Immutable, stated that Immutable allows Gods Unchained to implement a new meta-system that was previously impossible.",
    "key": "",
    "index": 16,
    "coindesc": ""
  },
  {
    "symbol": "stx",
    "name": "Stacks",
    "image": "https://assets.coingecko.com/coins/images/2069/large/Stacks_logo_full.png?1696503035",
    "current_price": 2.06,
    "market_cap": 2962355143,
    "market_cap_rank": 18,
    "fully_diluted_valuation": 3740854553,
    "total_volume": 64683204,
    "high_24h": 2.06,
    "low_24h": 1.96,
    "circulating_supply": 1439660797.86789,
    "total_supply": 1818000000,
    "max_supply": 1818000000,
    "ath": 2.55,
    "atl": 0.03633034,
    "coin_description": "Stacks is a layer for smart contracts built on Bitcoin, where transactions on Stacks are permanently stored on the Bitcoin blockchain. Stacks is a smart contract blockchain network that extends the Bitcoin blockchain by adopting it as its data settlement layer. Through this approach, it hopes to leverage the security and decentralization level of the Bitcoin blockchain while running an execution layer that offers improved user experience and more utility than P2P transfers. tacks blockchain runs the POX (Proof of Transfer) consensus mechanism, a tokenomics approach to decentralized consensus. The Stacks token (STX) is the native token of the Stacks network.",
    "key": "",
    "index": 17,
    "coindesc": ""
  },
  {
    "symbol": "kas",
    "name": "Kaspa",
    "image": "https://assets.coingecko.com/coins/images/25751/large/kaspa-icon-exchanges.png?1696524837",
    "current_price": 0.13008,
    "market_cap": 2958373311,
    "market_cap_rank": 19,
    "fully_diluted_valuation": 2958318120,
    "total_volume": 42758362,
    "high_24h": 0.131701,
    "low_24h": 0.126224,
    "circulating_supply": 22729978721.9089,
    "total_supply": 22729554673.1197,
    "max_supply": 28704026601,
    "ath": 0.133669,
    "atl": 0.00013621,
    "coin_description": "Kaspa is a proof-of-work cryptocurrency which implements the GHOSTDAG protocol. Unlike traditional blockchains, GHOSTDAG does not orphan blocks created in parallel, but rather allows them to coexist and orders them in consensus. Whereby Kaspa is actually a blockDAG; you can see GHOSTDAG in action in a real time blockDAG visualizer.This generalization of Nakamoto consensus allows for secure operation while maintaining very high block rates (currently one block per second, aiming for 32/sec, with visions of 100/sec) and minuscule confirmation times dominated by internet latency (cf. chapter 6 of the research paper for some initial benchmarks).",
    "key": "",
    "index": 18,
    "coindesc": ""
  },
  {
    "symbol": "op",
    "name": "Optimism",
    "image": "https://assets.coingecko.com/coins/images/25244/large/Optimism.png?1696524385",
    "current_price": 2.95,
    "market_cap": 2824392197,
    "market_cap_rank": 20,
    "fully_diluted_valuation": 12670716186,
    "total_volume": 98426225,
    "high_24h": 2.96,
    "low_24h": 2.81,
    "circulating_supply": 957378568,
    "total_supply": 4294967296,
    "max_supply": 4294967296,
    "ath": 3.31,
    "atl": 0.328951,
    "coin_description": "Optimism (OP) is a layer-two blockchain on top of Ethereum. Optimism benefits from the security of the Ethereum mainnet and helps scale the Ethereum ecosystem by using optimistic rollups. That means transactions are trustlessly recorded on Optimism but ultimately secured on Ethereum. Optimism is one of the biggest scaling solutions for Ethereum with over $500 million in TVL. It is home to 97 protocols, the biggest being Synthetix (SNX), a derivatives exchange, Uniswap (UNI), a DEX, and Velodrome (VELO), an AMM. Users can begin their journey on Optimism by adding the chain on their Metamask and bridging tokens like ETH to the L2. On May 31, 2022, Optimism conducted a highly anticipated airdrop of its OP token.",
    "key": "",
    "index": 19,
    "coindesc": ""
  },
  {
    "symbol": "link",
    "name": "Chainlink",
    "image": "https://assets.coingecko.com/coins/images/877/large/chainlink-new-logo.png?1547034700",
    "current_price": 9.67,
    "market_cap": 4523882294,
    "market_cap_rank": 21,
    "fully_diluted_valuation": 9673882431,
    "total_volume": 698346123,
    "high_24h": 0.41,
    "low_24h": 0.15,
    "circulating_supply": 412345678,
    "total_supply": 1000000000,
    "max_supply": null,
    "ath": 0.133669,
    "atl": 0.00013621,
    "coin_description": "Chainlink is a framework for building Decentralized Oracle Networks (DONs) that bring real-world data onto blockchain networks, enabling the creation of hybrid smart contracts. These DONs provide decentralized services such as Price Feeds, Proof of Reserve, Verifiable Randomness, Keepers, and the ability to connect to any web API.",
    "key": "",
    "index": 21,
    "coindesc": ""
  },
  {
    "symbol": "algo",
    "name": "Algorand",
    "image": "https://assets.coingecko.com/coins/images/4380/large/download.png?1547039725",
    "current_price": 0.245,
    "market_cap": 1854320542,
    "market_cap_rank": 22,
    "fully_diluted_valuation": 3124325128,
    "total_volume": 120832180,
    "high_24h": -0.0032,
    "low_24h": -1.29,
    "circulating_supply": 345678912,
    "total_supply": 8179582327,
    "max_supply": 1000000000,
    "ath": 0.1669,
    "atl": 0.00011,
    "coin_description": "ALGO tokens can be traded on centralized crypto exchanges. The most popular exchange to buy and trade Algorand is Gate.io, where the most active trading pair ALGO/USDT has a trading volume of $2,486,050 in the last 24 hours. Other popular options include MEXC and LBank.",
    "key": "",
    "index": 22,
    "coindesc": ""
  },
  {
    "symbol": "xlm",
    "name": "Stellar",
    "image": "https://assets.coingecko.com/coins/images/100/large/Stellar_symbol_black_RGB.png?1638185634",
    "current_price": 0.087,
    "market_cap": 2504323457,
    "market_cap_rank": 23,
    "fully_diluted_valuation": 4314324532,
    "total_volume": 195432832,
    "high_24h": 0.003,
    "low_24h": 3.57,
    "circulating_supply": 567891234,
    "total_supply": 50001786967,
    "max_supply": 50001786967,
    "ath": 4.56,
    "atl": 0.01,
    "coin_description": "XLM tokens can be traded on centralized crypto exchanges. The most popular exchange to buy and trade Stellar is DigiFinex, where the most active trading pair XLM/USDT has a trading volume of $270,244 in the last 24 hours. Other popular options include Kraken and Coinbase Exchange.",
    "key": "",
    "index": 23,
    "coindesc": ""
  },
  {
    "symbol": "atom",
    "name": "Cosmos",
    "image": "https://assets.coingecko.com/coins/images/1481/large/cosmos_hub.png?1555657960",
    "current_price": 12.45,
    "market_cap": 2984321243,
    "market_cap_rank": 24,
    "fully_diluted_valuation": 3658321234,
    "total_volume": 287832542,
    "high_24h": 0.56,
    "low_24h": 4.72,
    "circulating_supply": 678912345,
    "total_supply": 390930035,
    "max_supply": null,
    "ath": 18.9,
    "atl": 0.25,
    "coin_description": "The Cosmos network consists of many independent, parallel blockchains, called zones, each powered by classical Byzantine fault-tolerant (BFT) consensus protocols like Tendermint (already used by platforms like ErisDB). Some zones act as hubs with respect to other zones, allowing many zones to interoperate through a shared hub.",
    "key": "",
    "index": 24,
    "coindesc": ""
  },
  {
    "symbol": "hbar",
    "name": "Hedera",
    "image": "https://assets.coingecko.com/coins/images/3688/large/hbar.png?1637042612",
    "current_price": 0.05,
    "market_cap": 1078321234,
    "market_cap_rank": 25,
    "fully_diluted_valuation": 1504321543,
    "total_volume": 28792343,
    "high_24h": 0.0012,
    "low_24h": 2.47,
    "circulating_supply": 789012345,
    "total_supply": 50000000000,
    "max_supply": 50000000000,
    "ath": 0.2,
    "atl": 0.001,
    "coin_description": "Hedera is a decentralized public network where developers can build secure, fair applications with near real-time consensus. The platform is owned and governed by a council of global innovators including Avery Dennison, Boeing, Deutsche Telekom, DLA Piper, FIS (WorldPay), Google, IBM, LG Electronics, Magalu, Nomura, Swirlds, Tata Communications, University College London (UCL), Wipro, and Zain Group.",
    "key": "",
    "index": 25,
    "coindesc": ""
  },
  {
    "symbol": "aave",
    "name": "Aave",
    "image": "https://assets.coingecko.com/coins/images/12645/large/AAVE.png?1601374110",
    "current_price": 72.34,
    "market_cap": 1454321834,
    "market_cap_rank": 26,
    "fully_diluted_valuation": 1864321323,
    "total_volume": 187632132,
    "high_24h": 1.45,
    "low_24h": 2.05,
    "circulating_supply": 891234567,
    "total_supply": 1600000000,
    "max_supply": 1600000000,
    "ath": 120.0,
    "atl": 15.0,
    "coin_description": "Aave is a decentralized money market protocol where users can lend and borrow cryptocurrency across 20 different assets as collateral. The protocol has a native token called AAVE, which is also a governance token that lets the community decide the direction of the protocol in a collective manner. Lenders can earn interest by providing liquidity to the market, while borrowers can borrow by collateralizing their cryptoassets to take out loans from the liquidity pools.",
    "key": "",
    "index": 26,
    "coindesc": ""
  },
  {
    "symbol": "egld",
    "name": "MultiversX",
    "image": "https://assets.coingecko.com/coins/images/12335/large/egld-token-logo.png?1626341589",
    "current_price": 42.34,
    "market_cap": 962321434,
    "market_cap_rank": 27,
    "fully_diluted_valuation": 1340321534,
    "total_volume": 89234123,
    "high_24h": 1.12,
    "low_24h": 2.71,
    "circulating_supply": 123456789,
    "total_supply": 27048738,
    "max_supply": 31415926,
    "ath": 75.0,
    "atl": 10.0,
    "key": "",
    "index": 26,
    "coin_description": "MultiversX is a blockchain platform designed to support decentralized finance (DeFi) applications and smart contracts. It aims to provide high throughput, low latency, and scalability to enable a wide range of decentralized applications (dApps). MultiversX uses a unique consensus mechanism called Secure Proof of Stake (SPoS) to achieve consensus and secure the network.",
    "coindesc": ""
  },
  {
    "symbol": "fil",
    "name": "Filecoin",
    "image": "https://assets.coingecko.com/coins/images/12817/large/filecoin.png?1602753933",
    "current_price": 3.45,
    "market_cap": 1824321453,
    "market_cap_rank": 28,
    "fully_diluted_valuation": 2348321234,
    "total_volume": 234823212,
    "high_24h": 0.12,
    "low_24h": 3.48,
    "circulating_supply": 234567890,
    "total_supply": 1960214672,
    "max_supply": 1960214672,
    "ath": 85.0,
    "atl": 1.0,
    "key": "",
    "index": 26,
    "coin_description": "Filecoin is a decentralized storage network based on the Interplanetary File Storage (IPFS) protocol. It is designed to utilized unused storage globally into an efficient storage market for users to pay for low cost storage. The objective is to ensure file storage is permanent and distributed across the web. Contrast this with centralized cloud storage solution such as Amazon Web Services, Google Cloud, or Dropbox, where data are stored in servers owned by these private corporations.",
    "coindesc": ""
  },
  {
    "symbol": "mana",
    "name": "Decentraland",
    "image": "https://assets.coingecko.com/coins/images/878/large/decentraland-mana.png?1550328092",
    "current_price": 0.45,
    "market_cap": 987654321,
    "market_cap_rank": 29,
    "fully_diluted_valuation": 1204321543,
    "total_volume": 125432987,
    "high_24h": 0.03,
    "low_24h": 7.14,
    "circulating_supply": 345678901,
    "total_supply": 2193179327,
    "max_supply": 2193179327,
    "ath": 1.2,
    "atl": 0.005,
    "key": "",
    "index": 26,
    "coin_description": "Have you read or watched Ready Player One? If you have then you know where we are headed. Decentraland is a decentralized VR (virtual reality) world that is powered by the Ethereum blockchain. In this virtual world, you can purchase land, build it, monetize, and immerse into the applications and content that is built by other users. What distinguishes Decentraland from other VR projects is its decentralized nature. Land and in-game currency are powered by the Ethereum blockchain which give users complete ownership and promotes transparency.",
    "coindesc": ""
  },
  {
    "symbol": "sand",
    "name": "Sandbox",
    "image": "https://assets.coingecko.com/coins/images/12129/large/sandbox_logo.jpg?1597397942",
    "current_price": 0.62,
    "market_cap": 1624329876,
    "market_cap_rank": 30,
    "fully_diluted_valuation": 2014321543,
    "total_volume": 232432153,
    "high_24h": 0.05,
    "low_24h": 8.77,
    "circulating_supply": 456789012,
    "total_supply": 3000000000,
    "max_supply": 3000000000,
    "ath": 2.5,
    "atl": 0.01,
    "key": "",
    "index": 26,
    "coin_description": "Sandbox is a decentralized community owned virtual world. Creators can host custom games and events on the virtual world. Analysts like to compare Sandbox with Roblox due to their similarity in concepts. However the key difference with Sandbox is that players have true ownership of the virtual world assets in the form of NFTs. By doing so, LAND owners can host contests and events, stake SAND to earn and customize assets, monetize assets and experiences, vote in the metaverse governance, play games, and more.",
    "coindesc": ""
  },
  {
    "symbol": "rune",
    "name": "THORChain",
    "image": "https://assets.coingecko.com/coins/images/6595/large/RUNE.png?1618647750",
    "current_price": 1.87,
    "market_cap": 1054321432,
    "market_cap_rank": 31,
    "fully_diluted_valuation": 1384321543,
    "total_volume": 184432123,
    "high_24h": 0.12,
    "low_24h": 6.85,
    "circulating_supply": 567890123,
    "total_supply": 412959528,
    "max_supply": 5000000000,
    "ath": 5.0,
    "atl": 0.1,
    "key": "",
    "index": 26,
    "coin_description": "ThorChain is a decentralized liquidity network with an interoperable blockchain that allows cross-chain token swaps in a non-custodial manner. It does not peg or wrap assets, but simply allows users to swap tokens across various Layer 1 blockchains. So, traders on ThorChain can seamlessly move from Bitcoin to Ethereum, to Polkadot and etc. without having to register for an exchange or go through KYC, like on CEXs. Hence, users are minimally exposed to custody and counterparty risks.",
    "coindesc": ""
  },
  {
    "symbol": "kava",
    "name": "Kava",
    "image": "https://assets.coingecko.com/coins/images/9761/large/kava.png?1571069797",
    "current_price": 1.05,
    "market_cap": 423432143,
    "market_cap_rank": 32,
    "fully_diluted_valuation": 543432154,
    "total_volume": 55432121,
    "high_24h": 0.08,
    "low_24h": 8.25,
    "circulating_supply": 678901234,
    "total_supply": 23885941763,
    "max_supply": 23885941763,
    "ath": 10.0,
    "atl": 0.05,
    "key": "",
    "index": 26,
    "coin_description": "Kava is a cross-chain DeFi platform that allows users to borrow, lend, and earn using crypto assets. It supports a wide range of assets and offers high yields through its lending and borrowing protocols.",
    "coindesc": ""
  },
  {
    "symbol": "zec",
    "name": "Zcash",
    "image": "https://assets.coingecko.com/coins/images/486/large/circle-zcash-color.png?1547034197",
    "current_price": 39.72,
    "market_cap": 732123432,
    "market_cap_rank": 33,
    "fully_diluted_valuation": 893432154,
    "total_volume": 82432123,
    "high_24h": 1.23,
    "low_24h": 3.19,
    "circulating_supply": 789012345,
    "total_supply": 412959528,
    "max_supply": 4000000000,
    "ath": 600.0,
    "atl": 20.0,
    "key": "",
    "index": 26,
    "coin_description": "Zcash is a privacy-focused cryptocurrency which is based on Bitcoin's codebase. It shares many similarities, such as a fixed total supply of 21 million units. Transactions can be transparent, similar to bitcoin transactions, or they can be shielded transactions which use a type of zero-knowledge proof to provide anonymity in transactions. Zcash coins are either in a transparent pool or a shielded pool.",
    "coindesc": ""
  },
  {
    "symbol": "hnt",
    "name": "Helium",
    "image": "https://assets.coingecko.com/coins/images/4284/large/Helium_HNT.png?1612620071",
    "current_price": 1.65,
    "market_cap": 262432143,
    "market_cap_rank": 34,
    "fully_diluted_valuation": 312432154,
    "total_volume": 73213221,
    "high_24h": 0.05,
    "low_24h": 3.12,
    "circulating_supply": 890123456,
    "total_supply": 1000000000,
    "max_supply": null,
    "ath": 5.0,
    "atl": 0.2,
    "key": "",
    "index": 26,
    "coin_description": "Helium is a decentralized wireless network that enables low-power IoT devices to send data to and from the internet. It uses a novel consensus algorithm called Proof-of-Coverage (PoC) to validate network coverage and reward miners with HNT tokens.",
    "coindesc": ""
  },
  {
    "symbol": "miota",
    "name": "IOTA",
    "image": "https://assets.coingecko.com/coins/images/692/large/IOTA_Swirl.png?1600081628",
    "current_price": 0.16,
    "market_cap": 421432123,
    "market_cap_rank": 35,
    "fully_diluted_valuation": 532432154,
    "total_volume": 25432123,
    "high_24h": 0.002,
    "low_24h": 1.27,
    "circulating_supply": 901234567,
    "total_supply": 212259238,
    "max_supply": 202250245,
    "ath": 5.0,
    "atl": 0.1,
    "key": "",
    "index": 26,
    "coin_description": "IOTA is a distributed ledger technology designed to power the Internet of Things (IoT) ecosystem. It uses a scalable, feeless, and decentralized network to enable machines to securely exchange data and value.",
    "coindesc": ""
  },
  {
    "symbol": "comp",
    "name": "Compound",
    "image": "https://assets.coingecko.com/coins/images/10775/large/COMP.png?1592625425",
    "current_price": 234.56,
    "market_cap": 876543210,
    "market_cap_rank": 36,
    "fully_diluted_valuation": 234567890,
    "total_volume": 567890123,
    "high_24h": 7.89,
    "low_24h": 3.21,
    "circulating_supply": 123456789,
    "total_supply": 212659244,
    "max_supply": null,
    "ath": 900.0,
    "atl": 50.0,
    "key": "",
    "index": 26,
    "coin_description": "Compound is an algorithmic, autonomous interest rate protocol built for developers to unlock a universe of open financial applications. It allows users to earn interest or borrow assets against collateral.",
    "coindesc": ""
  },
  {
    "symbol": "zen",
    "name": "Horizen",
    "image": "https://assets.coingecko.com/coins/images/691/large/horizen.png?1555052241",
    "current_price": 12.34,
    "market_cap": 654321098,
    "market_cap_rank": 37,
    "fully_diluted_valuation": 765432109,
    "total_volume": 678901234,
    "high_24h": 0.456,
    "low_24h": 3.45,
    "circulating_supply": 234567890,
    "total_supply": 314459238,
    "max_supply": 205660245,
    "ath": 50.0,
    "atl": 0.5,
    "key": "",
    "index": 26,
    "coin_description": "ZEN tokens can be traded on centralized crypto exchanges. The most popular exchange to buy and trade Horizen is Binance, where the most active trading pair ZEN/USDT has a trading volume of $2,334,227 in the last 24 hours. Other popular options include DigiFinex and Bybit.",
    "coindesc": ""
  },
  {
    "symbol": "rvn",
    "name": "Ravencoin",
    "image": "https://assets.coingecko.com/coins/images/3412/large/ravencoin.png?1548386057",
    "current_price": 0.567,
    "market_cap": 765432109,
    "market_cap_rank": 38,
    "fully_diluted_valuation": 876543210,
    "total_volume": 567890123,
    "high_24h": -0.987,
    "low_24h": -2.34,
    "circulating_supply": 567890123,
    "total_supply": 112249238,
    "max_supply": 102250245,
    "ath": 1.5,
    "atl": 0.01,
    "key": "",
    "index": 26,
    "coin_description": "Ravencoin is a blockchain platform that specializes in the creation and transfer of digital assets. It is designed to be a more secure and private alternative to Bitcoin for asset issuance and ownership.",
    "coindesc": ""
  },
  {
    "symbol": "zil",
    "name": "Zilliqa",
    "image": "https://assets.coingecko.com/coins/images/2687/large/Zilliqa-logo.png?1547036894",
    "current_price": 0.123,
    "market_cap": 876543210,
    "market_cap_rank": 39,
    "fully_diluted_valuation": 987654321,
    "total_volume": 456789012,
    "high_24h": 0.654,
    "low_24h": 0.123,
    "circulating_supply": 345678901,
    "total_supply": 212259238,
    "max_supply": null,
    "ath": 1.0,
    "atl": 0.001,
    "key": "",
    "index": 26,
    "coin_description": "Zilliqa (ZIL) is a token developed in the year 2017. Zilliqa is mainly based on the concept of Sharding and primarily aims at improving the scalability of the cryptocurrency networks as in case of Bitcoin or Ethereum. The white paper mentions that the transactions speed would be approximately a thousand times more than that of Ethereum network. Ziliqa is fast, secured and decentralized. Zilliqa’s high throughput means that you can focus on developing your ideas without worrying about network congestion, high transaction fees or security which are the key issues with legacy blockchain platforms.",
    "coindesc": ""
  },
  {
    "symbol": "nano",
    "name": "Nano",
    "image": "https://assets.coingecko.com/coins/images/756/large/nano-coin-logo.png?1547034501",
    "current_price": 5.67,
    "market_cap": 987654321,
    "market_cap_rank": 40,
    "fully_diluted_valuation": 1098765432,
    "total_volume": 123456789,
    "high_24h": 0.987,
    "low_24h": 2.34,
    "circulating_supply": 456789012,
    "total_supply": 312259238,
    "max_supply": 102250245,
    "ath": 37.62,
    "atl": 0.01,
    "key": "",
    "index": 26,
    "coin_description": "Nano is a cryptocurrency designed for fast and feeless transactions. It uses a unique consensus mechanism called Open Representative Voting (ORV) to achieve consensus and confirm transactions instantly.",
    "coindesc": ""
  }
]
